BAS BMEKZU Project/src/Enums/ИНАГРО_СпособыВводаДанныхОВремени/ИНАГРО_СпособыВводаДанныхОВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_СпособыВводаДанныхОВремени</name>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>ВЦеломЗаПериод</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ЗаДень</name>
  </enumValues>
  <enumValues>
    <name>ПерваяПоловинаМесяца</name>
  </enumValues>
  <enumValues>
    <name>ВтораяПоловинаМесяца</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйПериод</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/ИНАГРО_КлассификаторИспользованияРабочегоВремени/ИНАГРО_КлассификаторИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИНАГРО_КлассификаторИспользованияРабочегоВремени</name>
  <predefined>
    <items>
      <name>ГосударственныеОбязанности</name>
    </items>
    <items>
      <name>ПочасовкаСдельщиковВнутреннесменная</name>
    </items>
    <items>
      <name>ДетиДо18</name>
    </items>
    <items>
      <name>Карантин</name>
    </items>
    <items>
      <name>Опоздания</name>
    </items>
    <items>
      <name>СдельнаяРаботаПочасовыхРаботников</name>
    </items>
    <items>
      <name>ПочасовкаСдельщиков</name>
    </items>
    <items>
      <name>ДопризывнаяПодготовка</name>
    </items>
    <items>
      <name>ПростоиПоВинеРаботников</name>
    </items>
    <items>
      <name>ПреждевременноеОкончаниеРаботы</name>
    </items>
    <items>
      <name>УчебаБезСохраненияЗП</name>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателяВнутрисменный</name>
    </items>
    <items>
      <name>КомандировкаСельхозРаботы75</name>
    </items>
    <items>
      <name>ВоенныеСборы</name>
    </items>
    <items>
      <name>КомандировкаСельхозРаботы</name>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
    </items>
    <items>
      <name>ЖенщинамНаКормлениеДетей</name>
    </items>
    <items>
      <name>ПростоиПоВинеРаботниковВнутрисменные</name>
    </items>
    <items>
      <name>ВыходныеДни</name>
    </items>
    <items>
      <name>Работа</name>
      <description>01</description>
    </items>
    <items>
      <name>РаботаНеполныйРабочийДень</name>
      <description>02</description>
    </items>
    <items>
      <name>СверхурочныеСдельщиков</name>
      <description>03</description>
    </items>
    <items>
      <name>Вечерние</name>
      <description>03</description>
    </items>
    <items>
      <name>Ночные</name>
      <description>04</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>05</description>
    </items>
    <items>
      <name>РаботаВыходныеИПраздничные</name>
      <description>06</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>07</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>08</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>09</description>
    </items>
    <items>
      <name>ОтпускЧернобыльский</name>
      <description>10</description>
    </items>
    <items>
      <name>ОтпускТворческий</name>
      <description>11</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>12</description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>13</description>
    </items>
    <items>
      <name>ДополнительныйОтпускБезОплаты</name>
      <description>14</description>
    </items>
    <items>
      <name>ОтпускДополнительныйНаДетей</name>
      <description>15</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>16</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>17</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>18</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>19</description>
    </items>
    <items>
      <name>ПереводНаНеполныйДень</name>
      <description>20</description>
    </items>
    <items>
      <name>ПереводНаДругуюРаботу</name>
      <description>21</description>
    </items>
    <items>
      <name>НеотработанноеВремяПоЗаконодательству</name>
      <description>22</description>
    </items>
    <items>
      <name>Простой</name>
      <description>23</description>
    </items>
    <items>
      <name>Прогул</name>
      <description>24</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>25</description>
    </items>
    <items>
      <name>Болезнь</name>
      <description>26</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>27</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>28</description>
    </items>
    <items>
      <name>ДругиеНеявкиПоКолДоговору</name>
      <description>29</description>
    </items>
    <items>
      <name>ДругиеНеявки</name>
      <description>30</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УважительнаяПричинаДляБольничных</name>
    <comment>Является уважительной причиной для расчета больничных</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/CommonModules/ИНАГРО_УчетРабочегоВремениКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняются необходимые действия
//
Процедура ДанныеГрафикаРассчитатьИтогоПоСтроке(ДанныеСтроки) Экспорт
	
	ВсегоДней = 0;
	ВсегоЧасов = 0;
	Для НомерДня = 1 По 31 Цикл
		ВсегоЧасов = ВсегоЧасов + ДанныеСтроки["День" + НомерДня];
		ВсегоДней = ВсегоДней + ?(ДанныеСтроки["День" + НомерДня] > 0, 1, 0)
	КонецЦикла;
	ДанныеСтроки.ИтогДни = ВсегоДней;
	ДанныеСтроки.ИтогЧасы = ВсегоЧасов;
	
КонецПроцедуры

// Выполняются необходимые действия
//
Функция ДанныеГрафикаЧасыПоДнямЦикла(ШаблонЗаполнения, ДанныеОРабочихЧасах) Экспорт
	
	ЧасыПоДнямЦикла = Новый Соответствие;
	
	Для Каждого ДеньЦикла Из ШаблонЗаполнения Цикл
		ЧасыЗаДень = Новый Соответствие;
		
		ДанныеОВремениЗаДень = ДанныеОРабочихЧасах.НайтиСтроки(Новый Структура("НомерДня", ДеньЦикла.НомерСтроки));
		Для Каждого ДанныеВидуВремени Из ДанныеОВремениЗаДень Цикл
			ЧасыЗаДень.Вставить(ПредопределенноеЗначение("Справочник.ИНАГРО_КлассификаторИспользованияРабочегоВремени.Работа"), ДанныеВидуВремени.Часы);
			ЧасыЗаДень.Вставить(ПредопределенноеЗначение("Справочник.ИНАГРО_КлассификаторИспользованияРабочегоВремени.Вечерние"), ДанныеВидуВремени.ЧасыВечерние);
			ЧасыЗаДень.Вставить(ПредопределенноеЗначение("Справочник.ИНАГРО_КлассификаторИспользованияРабочегоВремени.Ночные"), ДанныеВидуВремени.ЧасыНочные);
		КонецЦикла;
		
		ЧасыПоДнямЦикла.Вставить(ДеньЦикла.НомерСтроки, ЧасыЗаДень);
	КонецЦикла;
	
	Возврат ЧасыПоДнямЦикла;
	
КонецФункции

// Функция определяет количество дней в месяце.
//
// Параметры:
//	Дата - любая дата месяца
//
// Возвращаемое значение
//	- число, количество дней в месяце
//
Функция КоличествоДнейМесяца(Дата) Экспорт
	Возврат День(КонецМесяца(Дата));
КонецФункции

// Выполняются необходимые действия
//
Процедура ТабельУстановитьПериодДокумента(Форма) Экспорт
	
	Если Форма.Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыВводаДанныхОВремени.ПерваяПоловинаМесяца") Тогда
		Форма.Объект.ДатаНачалаПериода = НачалоМесяца(Форма.Объект.ПериодРегистрации);
		Форма.Объект.ДатаОкончанияПериода = Дата(Год(Форма.Объект.ПериодРегистрации), Месяц(Форма.Объект.ПериодРегистрации), 15);
	ИначеЕсли Форма.Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыВводаДанныхОВремени.ВтораяПоловинаМесяца") Тогда
		Форма.Объект.ДатаНачалаПериода = Дата(Год(Форма.Объект.ПериодРегистрации), Месяц(Форма.Объект.ПериодРегистрации), 16);
		Форма.Объект.ДатаОкончанияПериода = КонецМесяца(Форма.Объект.ПериодРегистрации);
	ИначеЕсли Форма.Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыВводаДанныхОВремени.Месяц") Тогда
		Форма.Объект.ДатаНачалаПериода = НачалоМесяца(Форма.Объект.ПериодРегистрации);
		Форма.Объект.ДатаОкончанияПериода = КонецМесяца(Форма.Объект.ПериодРегистрации);
	ИначеЕсли Форма.Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыВводаДанныхОВремени.ВЦеломЗаПериод") Тогда
		Форма.Объект.ДатаНачалаПериода = НачалоМесяца(Форма.Объект.ПериодРегистрации);
		Форма.Объект.ДатаОкончанияПериода = КонецМесяца(Форма.Объект.ПериодРегистрации);
	КонецЕсли;
	
КонецПроцедуры

// Выполняются необходимые действия
//
Процедура ТабельУстановитьДоступностьЭлементовПериодаВводаДанных(Форма) Экспорт
	
	Если Форма.Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыВводаДанныхОВремени.ПерваяПоловинаМесяца") Тогда
		Форма.Элементы.ДатаНачалаПериода.Доступность = Ложь;
		Форма.Элементы.ДатаОкончанияПериода.Доступность = Ложь;
		Форма.Элементы.ГруппаСпособЗаполнения.ТекущаяСтраница = Форма.Элементы.ГруппаСпособЗаполнения.ПодчиненныеЭлементы.ГруппаПоДням;
	ИначеЕсли Форма.Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыВводаДанныхОВремени.ВтораяПоловинаМесяца") Тогда
		Форма.Элементы.ДатаНачалаПериода.Доступность = Ложь;
		Форма.Элементы.ДатаОкончанияПериода.Доступность = Ложь;
		Форма.Элементы.ГруппаСпособЗаполнения.ТекущаяСтраница = Форма.Элементы.ГруппаСпособЗаполнения.ПодчиненныеЭлементы.ГруппаПоДням;
	ИначеЕсли Форма.Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыВводаДанныхОВремени.Месяц") Тогда
		Форма.Элементы.ДатаНачалаПериода.Доступность = Ложь;
		Форма.Элементы.ДатаОкончанияПериода.Доступность = Ложь;
		Форма.Элементы.ГруппаСпособЗаполнения.ТекущаяСтраница = Форма.Элементы.ГруппаСпособЗаполнения.ПодчиненныеЭлементы.ГруппаПоДням;
	ИначеЕсли Форма.Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыВводаДанныхОВремени.ВЦеломЗаПериод") Тогда
		Форма.Элементы.ДатаНачалаПериода.Доступность = Ложь;
		Форма.Элементы.ДатаОкончанияПериода.Доступность = Ложь;
		Форма.Элементы.ГруппаСпособЗаполнения.ТекущаяСтраница = Форма.Элементы.ГруппаСпособЗаполнения.ПодчиненныеЭлементы.ГруппаЗаПериод;
	ИначеЕсли Форма.Объект.СпособВводаДанных = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыВводаДанныхОВремени.ПроизвольныйПериод") Тогда
		Форма.Элементы.ДатаНачалаПериода.Доступность = Истина;
		Форма.Элементы.ДатаОкончанияПериода.Доступность = Истина;
		Форма.Элементы.ГруппаСпособЗаполнения.ТекущаяСтраница = Форма.Элементы.ГруппаСпособЗаполнения.ПодчиненныеЭлементы.ГруппаПоДням;
	КонецЕсли;
	
КонецПроцедуры

// Выполняются необходимые действия
//
Функция ТабельОбозначенияВидовВремени(СоответствиеОбозначенийВидамВремени) Экспорт
	
	ОбозначенияВидовВремени = Новый Соответствие;
	Для Каждого КлючЗначение Из СоответствиеОбозначенийВидамВремени Цикл
		ОбозначенияВидовВремени.Вставить(КлючЗначение.Значение.ВидВремени, КлючЗначение.Ключ);
	КонецЦикла;
	
	Возврат ОбозначенияВидовВремени;
	
КонецФункции

// Выполняются необходимые действия
//
Процедура ТабельЗаполнитьИтогиПоСотруднику(СтрокаПоСотруднику, ОписаниеВидовВремени, ДеньНачалаПериода = 1, ДеньОкончанияПериода = 31) Экспорт
	
	МассивПриставок = Новый Массив(4);
	МассивПриставок[0] = "Первый";
	МассивПриставок[1] = "Второй";
	МассивПриставок[2] = "Третий";
	МассивПриставок[3] = "Четвертый";
	
	ИтогиПоВидамВремени = Новый Соответствие;
	
	МаксимальноеКоличествоДней = 0;
	Для ИндексДня = ДеньНачалаПериода По ДеньОкончанияПериода Цикл
		СтрокаИндексДня = Строка(ИндексДня);
		Для ИндексМассиваПриставок = 0 По 3 Цикл
			
			НазваниеЯчейкиВидВремени = МассивПриставок[ИндексМассиваПриставок] + "ВидВремени"+СтрокаИндексДня;
			НазваниеЯчейкиДней = МассивПриставок[ИндексМассиваПриставок] + "Часов"+СтрокаИндексДня;
			КоличествоЧасов = Строка(СтрокаПоСотруднику[НазваниеЯчейкиДней]);

			ВидВремени = СтрокаПоСотруднику[НазваниеЯчейкиВидВремени];
			
			Если ЗначениеЗаполнено(ВидВремени) Тогда
				Часы = СтрокаПоСотруднику[НазваниеЯчейкиДней];
				ИтогиПоВидуВремени = ИтогиПоВидамВремени.Получить(ВидВремени);
				Если ИтогиПоВидуВремени = Неопределено Тогда
					ИтогиПоВидамВремени.Вставить(ВидВремени, Новый Структура("Часы, Дни", Часы, 1));
				Иначе
					ИтогиПоВидуВремени.Часы = ИтогиПоВидуВремени.Часы + Часы;
					ИтогиПоВидуВремени.Дни = ИтогиПоВидуВремени.Дни + 1;
					Если ИтогиПоВидуВремени.Дни > МаксимальноеКоличествоДней Тогда
						МаксимальноеКоличествоДней = ИтогиПоВидуВремени.Дни;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	СтрокаПоСотруднику.ВремяИтог    =  ТабельПредставлениеИтогаПоВидуВремени(ИтогиПоВидамВремени, ОписаниеВидовВремени);
	ПредставлениеИтогаПоВидуВремени = ТабельПредставлениеИтогаПоВидуВремени(ИтогиПоВидамВремени, ОписаниеВидовВремени);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТабельПредставлениеИтогаПоВидуВремени(ИтогиПоВидамВремени, ОписаниеВидовВремени)
	ПредставлениеИтогаПоВидуВремени = "";
	
	Для Каждого ВидВремени Из ИтогиПоВидамВремени Цикл
		ОписаниеВидаВремени = ОписаниеВидовВремени.Получить(ВидВремени.Ключ);
	
		БуквенноеОбозначение = ?(ОписаниеВидаВремени = Неопределено, "", ОписаниеВидаВремени);
	
		ИтогиПоВидуВремени = ИтогиПоВидамВремени.Получить(ВидВремени.Ключ);
	
		Если ОписаниеВидаВремени <> Неопределено Тогда                           
		
			ПредставлениеИтогаПоВидуВремени = ПредставлениеИтогаПоВидуВремени + БуквенноеОбозначение + ?(БуквенноеОбозначение = "", "" , " ") 
											+ Строка(ИтогиПоВидуВремени.Дни) + НСтр("ru = ' д.';uk=' д.'") 
											+ ?(ИтогиПоВидуВремени.Часы > 0, " " + Строка(ИтогиПоВидуВремени.Часы) + НСтр("ru = ' ч.';uk=' г.'") , "") + Символы.ПС ;
		КонецЕсли;
	КонецЦикла;
										
	Возврат ПредставлениеИтогаПоВидуВремени;								
КонецФункции

#КонецОбласти
